export const galleryImages = [
  {
    id: 1,
    src: "https://images.unsplash.com/photo-1558618666-fcd25c85cd64?w=800&q=80",
    title: "Екстериорен детайлинг",
    description: "",
  },
  {
    id: 2,
    src: "https://images.unsplash.com/photo-1619405399517-d7fce0f13302?w=800&q=80",
    title: "Интериорен детайлинг",
    description: "",
  },
  {
    id: 3,
    src: "https://images.unsplash.com/photo-1601584115197-04ecc0da31d7?w=800&q=80",
    title: "Нанасяне на керамични покрития",
    description: "",
  },
  {
    id: 4,
    src: "https://images.unsplash.com/photo-1558618666-fcd25c85cd64?w=800&q=80",
    title: "Реновиране на фарове",
    description: "",
  },
  {
    id: 5,
    src: "https://images.unsplash.com/photo-1558618666-fcd25c85cd64?w=800&q=80",
    title: "Реновиране на фарове",
    description: "",
  },
];

export const servicesData = galleryImages.slice(0, 4).map((item, idx) => ({
  ...item,
  price: ["€500", "€250", "€300", "€150"][idx],
  details: [
    "Детайлно измиване на автомобила",
    "Дълбока грижа за интериора",
    "",
    "",
  ][idx],
  bullets: [
    [
      "Дълбоко почистване на подкалници, гуми и джанти",
      "Корекция на лака в нужните стъпки (пастиране/полиране)",
      "Полагане на премиум защита",
    ],
    [
      "Почистване/пране на седалки",
      "Подхранване на кожени салони",
      "Дълбоко почистване на врати, табло, стъкла и останалите елементи",
      "Пране/почистване на стелки",
    ],
    [
      "Лак и хром",
      "Черни пластмаси по екстериор и моторен отсег",
      "Джанти",
      "Кожен салон и волан",
      "Външна част на стъкла",
    ],
    ["Шлайфане в нужните стъпки", "Пастиране", "Полиране", "Защита"],
  ][idx],
}));
